In [32]:
import pandas as pd
import xlrd
import openpyxl

In [33]:
xls = pd.ExcelFile('Experiment_23.xlsx')

In [34]:
print(xls)

<pandas.io.excel._base.ExcelFile object at 0x000001FDC33F6E20>

In [35]:
df = xls.parse('Sheet1')

In [36]:
df

               Name Grade
0     Aarfa Hussain     B
1         Akira Rai     A
2       Alizeh Khan     A
3    Anushka Sharma     A
4   Bijilee Mandola     B
5      Bulbul Singh     C
6         Farah Ali     B
7      Ishika Desai     A
8      Jagat Janini     A
9             Mamta     A
10            Meera     A
11    Rosie Noronha     B
12         Rukhsana     C
13     Sejal Zaveri     C
14    Shashi Kumari     D
15    Shruti Kakkar     D
16   Simran Chaggal     C
17     Taani Sahini     C
18      Winnie Diaz     B

In [37]:
df['Grade'].value_counts()

A    7
B    5
C    5
D    2
Name: Grade, dtype: int64

In [38]:
df['Grade'].value_counts('A')

A    0.368421
B    0.263158
C    0.263158
D    0.105263
Name: Grade, dtype: float64

In [39]:
A = df['Grade'] == 'A'

In [40]:
df[A]

              Name Grade
1        Akira Rai     A
2      Alizeh Khan     A
3   Anushka Sharma     A
7     Ishika Desai     A
8     Jagat Janini     A
9            Mamta     A
10           Meera     A

In [41]:
x=df[A]

In [42]:
x

              Name Grade
1        Akira Rai     A
2      Alizeh Khan     A
3   Anushka Sharma     A
7     Ishika Desai     A
8     Jagat Janini     A
9            Mamta     A
10           Meera     A

In [43]:
First_class=len(x)

In [44]:
First_class

7

In [45]:
B = df['Grade'] == 'B'

In [46]:
y=df[B]

In [47]:
y

               Name Grade
0     Aarfa Hussain     B
4   Bijilee Mandola     B
6         Farah Ali     B
11    Rosie Noronha     B
18      Winnie Diaz     B

In [48]:
Second_class=len(y)

In [49]:
Second_class

5

In [50]:
C = df['Grade'] == 'C'
z=df[C]
z

              Name Grade
5     Bulbul Singh     C
12        Rukhsana     C
13    Sejal Zaveri     C
16  Simran Chaggal     C
17    Taani Sahini     C

In [51]:
Third_class=len(z)

In [52]:
Third_class

5

In [53]:
D = df['Grade'] == 'D'
u=df[D]
u

             Name Grade
14  Shashi Kumari     D
15  Shruti Kakkar     D

In [54]:
Fourth_class=len(u)

In [55]:
Fourth_class

2

In [56]:
import turtle

In [57]:
Grades = [First_class, Second_class, Third_class, Fourth_class]

In [58]:
Grades

[7, 5, 5, 2]

def drawBar(t, height):
   
    t.begin_fill()              
    t.left(90)
    t.forward(height)
    t.write(str(height))
    t.right(90)
    t.forward(40)
    t.right(90)
    t.forward(height)
    t.left(90)
    t.end_fill()
    

maxheight = max(Grades)
numbars = len(Grades)
border = 10



wn = turtle.Screen()            

wn.bgcolor("lightgreen")

tess = turtle.Turtle()      
tess.color("blue")
tess.fillcolor("red")
tess.pensize(3)



for a in Grades:
    drawBar(tess, a)

wn.exitonclick()